In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1= {
    "name": ["harry","Krishna","Uday"] ,
    "marks":[90,34,89],
    "city":["jaipur","chandigarh","Mumbai"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks        city
0    harry     90      jaipur
1  Krishna     34  chandigarh
2     Uday     89      Mumbai

In [5]:
df.to_csv("marks.csv")

In [6]:
df.to_csv("marks.csv", index=False)

In [7]:
df.head(2)

      name  marks        city
0    harry     90      jaipur
1  Krishna     34  chandigarh

In [8]:
df.tail(2)

      name  marks        city
1  Krishna     34  chandigarh
2     Uday     89      Mumbai

In [9]:
df.describe() # show different operations results on columns with integers

           marks
count   3.000000
mean   71.000000
std    32.046841
min    34.000000
25%    61.500000
50%    89.000000
75%    89.500000
max    90.000000

In [10]:
train = pd.read_csv('train.csv')

In [11]:
train

   Unnamed: 0  train_no  speed    junction
0           0     12345     90      jaipur
1           1    123435    161  chandigarh
2           2     12354    110      Mumbai
3           3     12324    134       Delhi

In [12]:
train['speed']

0     90
1    161
2    110
3    134
Name: speed, dtype: int64

In [13]:
train['speed'][2]

110

In [14]:
train['speed'][2] = 110

C:\Users\Hp\AppData\Local\Temp\ipykernel_20960\3340488298.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][2] = 110

In [15]:
train

   Unnamed: 0  train_no  speed    junction
0           0     12345     90      jaipur
1           1    123435    161  chandigarh
2           2     12354    110      Mumbai
3           3     12324    134       Delhi

In [16]:
train.to_csv("train.csv")

In [17]:
train.index = ["1st","2nd","3rd","4th"]

In [18]:
train

     Unnamed: 0  train_no  speed    junction
1st           0     12345     90      jaipur
2nd           1    123435    161  chandigarh
3rd           2     12354    110      Mumbai
4th           3     12324    134       Delhi